# Working with CSV files

In [1]:
import csv, os

In [2]:
with open('emp.csv') as file:
    line = 0
    reader = csv.reader(file)
    for row in reader:
        if line == 0:
            print(f'{", ".join(row)}')
            line += 1
        else:
            print(f'{row[0]} works in the {row[1]} department, and was born in {row[2]}.')

<b>Using Dict Reader

In [3]:
with open('emp.csv') as file:
    reader = csv.DictReader(file)
    print(f'{", ".join(reader.fieldnames)}')
    for row in reader:
        print('{} works in the {} department, and was born in {}'.format(row['name'], row['department'], row['birthday month']))

<b>Writing in to files

In [4]:
data = [['name', 'department', 'birthday month'], ['Durgam Rajesh', 'Computers', ' November'], ['John Doe', 'Accounting', 'January'], ['Erica Meyers', 'IT', 'March'], ['Kalyani', 'Business', ' September']]
with open('emp2.csv', 'w') as file:
    writer = csv.writer(file, delimiter=',', quotechar='"', quoting=csv.QUOTE_MINIMAL)
#     writer.writerow(['name', 'department', 'DOB']) #write each row of list of items
    writer.writerows(data)

In [5]:
!cat emp2.csv

name,department,birthday month

Durgam Rajesh,Computers, November

John Doe,Accounting,January

Erica Meyers,IT,March

Kalyani,Business, September

<b>Writing to csv using DictWriter

In [11]:
with open('emp3.csv', 'w') as file:
    fieldnames = ['emp_name', 'dept', 'birth month']
    writer = csv.DictWriter(file, fieldnames)
    writer.writeheader()
    writer.writerow({'emp_name': 'Suresh Veenam', 'dept': 'Accounting', 'birth month': 'November'})
    writer.writerow({'emp_name': 'Valentina Bladja', 'dept': 'IT', 'birth month': 'March'})

In [12]:
!cat emp3.csv

emp_name,dept,birth month

Suresh Veenam,Accounting,November

Valentina Bladja,IT,March

# using pandas

<h4>Reading csv file using pandas. Based on https://realpython.com/python-csv/

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('hr.csv')
df

             Name Hire Date   Salary  Sick Days remaining
0        superman  03/15/14  50000.0                   10
1          antman  06/01/15  65000.0                    8
2         prabhas  05/12/14  45000.0                   10
3   durgam rajesh  11/01/13  70000.0                    3
4         kalyani  08/12/14  48000.0                    7
5  vrushali karna  05/23/13  66000.0                    8

In [5]:
print(type(df['Hire Date'][0])) #so let's convert it to date

<class 'str'>

<b>To use a different column as the DataFrame index, add the index_col optional parameter:

In [9]:
df = pd.read_csv('hr.csv', index_col='Name')
df

               Hire Date   Salary  Sick Days remaining
Name
superman        03/15/14  50000.0                   10
antman          06/01/15  65000.0                    8
prabhas         05/12/14  45000.0                   10
durgam rajesh   11/01/13  70000.0                    3
kalyani         08/12/14  48000.0                    7
vrushali karna  05/23/13  66000.0                    8

<b>Lets force pandas to read data as a date with the parse_dates optional parameter

In [11]:
df = pd.read_csv('hr.csv', index_col='Name', parse_dates=['Hire Date'])
df

                Hire Date   Salary  Sick Days remaining
Name
superman       2014-03-15  50000.0                   10
antman         2015-06-01  65000.0                    8
prabhas        2014-05-12  45000.0                   10
durgam rajesh  2013-11-01  70000.0                    3
kalyani        2014-08-12  48000.0                    7
vrushali karna 2013-05-23  66000.0                    8

<b>Also tell pandas.read_csv() to ignore existing column names using the header=0 optional parameter. </b><i>Fix column names, use the names optional parameter to provide to override column names</i><br>

In [15]:
df = pd.read_csv('hr.csv', 
            index_col='Employee', 
            parse_dates=['Hired'], 
            header=0, 
            names=['Employee', 'Hired','Salary', 'Sick Days'])
df #Notice that, since the column names changed, the columns specified in the index_col and parse_dates optional parameters must also be changed.

                    Hired   Salary  Sick Days
Employee
superman       2014-03-15  50000.0         10
antman         2015-06-01  65000.0          8
prabhas        2014-05-12  45000.0         10
durgam rajesh  2013-11-01  70000.0          3
kalyani        2014-08-12  48000.0          7
vrushali karna 2013-05-23  66000.0          8

<h2>Writing CSV Files With pandas

In [16]:
df = pd.read_csv('hr.csv', 
            index_col='Employee', 
            parse_dates=['Hired'],
            header=0, 
            names=['Employee', 'Hired', 'Salary', 'Sick Days'])
df.to_csv('hrdata_modified.csv') # write in to csv

In [17]:
!cat hrdata_modified.csv

Employee,Hired,Salary,Sick Days
superman,2014-03-15,50000.0,10
antman,2015-06-01,65000.0,8
prabhas,2014-05-12,45000.0,10
durgam rajesh,2013-11-01,70000.0,3
kalyani,2014-08-12,48000.0,7
vrushali karna,2013-05-23,66000.0,8